local MainStorage = game:GetService('MainStorage')
local gg = require(MainStorage.code.common.MGlobal)    ---@type gg

--- 动画配置文件
---@class AnimationConfig
local AnimationConfig = {}
local loaded = false

local function LoadConfig()
    AnimationConfig.config = {
        ["站立恐怖鹿"] = {
            ["初始状态"] = "stand",
            ["状态"] = {
                ["stand"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 1,
                    ["名称"] = "站立动画",
                    ["切换"] = {
                        ["walk"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["attack1"] = {
                            ["时机"] = "攻击时",
                        },
                        -- 突脸动画
                        ["tulian"] = {
                            ["时机"] = "击杀玩家时",
                        },
                        ["shan"] = {
                            ["时机"] = "被攻击时",
                        },
                    },
                },
                -- 普通移动
                ["walk"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 1.3,
                    ["名称"] = "走路动画",
                    ["切换"] = {
                        ["stand"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["attack1"] = {
                            ["时机"] = "攻击时",
                        },
                        -- 突脸动画
                        ["tulian"] = {
                            ["时机"] = "击杀玩家时",
                        },
                        ["shan"] = {
                            ["时机"] = "被攻击时",
                        },
                    }
                },
                -- 攻击动画
                ["attack1"] = {
                    ["播放时间"] = 0.7,
                    ["触发效果时间"] = 0.3,
                    ["名称"] = "站立攻击动画",
                    ["播放模式"] = "单次",
                    ["切换"] = {
                        -- 普通移动
                        ["stand"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["静止中"] = true,
                        },
                        -- 普通移动
                        ["walk"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["移动中"] = true,
                        },
                        -- 被照射到
                        ["shan"] = {
                            ["时机"] = "被攻击时",
                            ["播放完成切换"] = false,
                        },

                    }
                },
                -- 被照射到的动画
                ["shan"] = {
                    ["名称"] = "shan",
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1.3,
                    ["切换"] = {
                        -- 普通移动
                        ["stand"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["静止中"] = true,
                        },
                        -- 普通移动
                        ["walk"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["移动中"] = true,
                        },
                    }
                },
            },
        },

        ["狂暴邪恶鹿"] = {
            ["初始状态"] = "idle",
            ["状态"] = {
                ["idle"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 1,
                    ["名称"] = "趴着动画",
                    ["切换"] = {
                        ["run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["attack"] = {
                            ["时机"] = "攻击时",
                        },
                        ["shan"] = {
                            ["时机"] = "被攻击时",
                        },
                    },
                },
                -- 普通移动
                ["run"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 1,
                    ["名称"] = "奔跑动画",
                    ["切换"] = {
                        ["idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["attack"] = {
                            ["时机"] = "攻击时",
                        },
                        ["shan"] = {
                            ["时机"] = "被攻击时",
                        },
                    },
                },
                -- 攻击动画
                ["attack"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1,
                    ["触发效果时间"] = 0.5,
                    ["名称"] = "攻击动画",
                    ["切换"] = {
                        -- 普通移动
                        ["idle"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["静止中"] = true,
                        },
                        -- 普通移动
                        ["run"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["移动中"] = true,
                        },
                        -- 被照射到
                        ["shan"] = {
                            ["时机"] = "被攻击时",
                            ["播放完成切换"] = false,
                        },
                    },
                },
                -- 被照射到的动画
                ["shan"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1.3,
                    ["名称"] = "照射动画",
                    ["切换"] = {
                        -- 普通移动
                        ["idle"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["静止中"] = true,
                        },
                        -- 普通移动
                        ["run"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["移动中"] = true,
                        },
                    }
                },
            }
        },

        ["玩家"] = {
            ["初始状态"] = "Idle",
            ["状态"] = {
                ["Idle"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 1,
                    ["名称"] = "站立动画",
                    ["切换"] = {
                        ["Run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["pikan"] = {
                            ["时机"] = "攻击时",
                        },
                        ["chi"] = {
                            ["时机"] = "吃东西时",
                        },
                        ["palouti"] = {
                            ["时机"] = "爬楼梯时",
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                        ["Jump"] = {
                            ["时机"] = "无",
                            ["跳跃中"] = true,
                        },
                    },
                },
                ["Jump"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1,
                    ["名称"] = "跳跃动画",
                    ["切换"] = {
                        ["Idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["Run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["pikan"] = {
                            ["时机"] = "攻击时",
                        },
                        ["chi"] = {
                            ["时机"] = "吃东西时",
                        },
                        ["palouti"] = {
                            ["时机"] = "爬楼梯时",
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                ["Run"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 1,
                    ["名称"] = "奔跑动画",
                    ["切换"] = {
                        ["Idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["pikan"] = {
                            ["时机"] = "攻击时",
                        },
                        ["chi"] = {
                            ["时机"] = "吃东西时",
                        },
                        ["palouti"] = {
                            ["时机"] = "爬楼梯时",
                        },
                        ["Jump"] = {
                            ["时机"] = "无",
                            ["跳跃中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                ["palouti"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 0.7,
                    ["名称"] = "奔跑动画",
                    ["切换"] = {
                        ["Idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["Run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["Jump"] = {
                            ["时机"] = "无",
                            ["跳跃中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                ["pikan"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 0.9,
                    ["触发效果时间"] = 0.4,
                    ["名称"] = "奔跑动画",
                    ["切换"] = {
                        ["Idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                            ["播放完成切换"] = true,
                        },
                        ["Run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                            ["播放完成切换"] = true,
                        },
                        ["Jump"] = {
                            ["时机"] = "无",
                            ["跳跃中"] = true,
                            ["播放完成切换"] = true,
                        },
                        ["pikan"] = {
                            ["时机"] = "攻击时",
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                ["die"] = {
                    ["播放模式"] = "定格",
                    ["播放时间"] = 1.5,
                    ["名称"] = "死亡动画",
                    ["切换"] = {
                        ["Idle"] = {
                            ["时机"] = "复活时",
                        },
                    },
                },
                ["chi"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1.3,
                    ["触发效果时间"] = 0.5,
                    ["名称"] = "吃东西动画",
                    ["切换"] = {
                        ["Idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                            ["播放完成切换"] = true,
                        },
                        ["Run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                            ["播放完成切换"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                        ["Jump"] = {
                            ["时机"] = "无",
                            ["跳跃中"] = true,
                            ["播放完成切换"] = true,
                        },
                    },
                },
            }
        },

        ["野兔"] = {
            ["初始状态"] = "idle",
            ["状态"] = {
                ["idle"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 1.7,
                    ["名称"] = "待机动画",
                    ["切换"] = {
                        ["run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                -- 普通移动
                ["run"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 0.7,
                    ["名称"] = "奔跑动画",
                    ["切换"] = {
                        ["idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                -- 死亡动画
                ["die"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1,
                    ["名称"] = "攻击动画",
                    ["切换"] = {},
                },
            }
        },

        ["野猪"] = {
            ["初始状态"] = "idle",
            ["状态"] = {
                ["idle"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 2,
                    ["名称"] = "待机动画",
                    ["切换"] = {
                        ["run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                        ["attack"] = {
                            ["时机"] = "攻击时",
                        },
                    },
                },
                -- 普通移动
                ["run"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 0.5,
                    ["名称"] = "奔跑动画",
                    ["切换"] = {
                        ["idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                        ["attack"] = {
                            ["时机"] = "攻击时",
                        },
                    },
                },
                -- 攻击动画
                ["attack"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1,
                    ["触发效果时间"] = 0.3,
                    ["名称"] = "攻击动画",
                    ["切换"] = {
                        -- 普通移动
                        ["idle"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["静止中"] = true,
                        },
                        -- 普通移动
                        ["run"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["移动中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                -- 死亡动画
                ["die"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 2.2,
                    ["名称"] = "攻击动画",
                    ["切换"] = {},
                },
            }
        },

        ["黑熊"] = {
            ["初始状态"] = "idle",
            ["状态"] = {
                ["idle"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 2,
                    ["名称"] = "待机动画",
                    ["切换"] = {
                        ["run"] = {
                            ["时机"] = "无",
                            ["移动中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                        ["attack"] = {
                            ["时机"] = "攻击时",
                        },
                    },
                },
                -- 普通移动
                ["run"] = {
                    ["播放模式"] = "循环",
                    ["播放时间"] = 0.5,
                    ["名称"] = "奔跑动画",
                    ["切换"] = {
                        ["idle"] = {
                            ["时机"] = "无",
                            ["静止中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                        ["attack"] = {
                            ["时机"] = "攻击时",
                        },
                    },
                },
                -- 攻击动画
                ["attack"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 1,
                    ["触发效果时间"] = 0.4,
                    ["名称"] = "攻击动画",
                    ["切换"] = {
                        -- 普通移动
                        ["idle"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["静止中"] = true,
                        },
                        -- 普通移动
                        ["run"] = {
                            ["时机"] = "无",
                            ["播放完成切换"] = true,
                            ["移动中"] = true,
                        },
                        ["die"] = {
                            ["时机"] = "死亡时",
                        },
                    },
                },
                -- 死亡动画
                ["die"] = {
                    ["播放模式"] = "单次",
                    ["播放时间"] = 2.2,
                    ["名称"] = "攻击动画",
                    ["切换"] = {},
                },
            }
        },
    }
    loaded = true
end

---@return Animation
function AnimationConfig.Get(name)
    if not loaded then
        LoadConfig()
    end
    return AnimationConfig.config[name]
end

---@return Animation[]
function AnimationConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return AnimationConfig.config
end
return AnimationConfig
