local MainStorage = game:GetService('MainStorage')
---@type gg
local gg = require(MainStorage.code.common.MGlobal)
---@type MobType
local MobType = require(MainStorage.code.common.ConfigTypes.MobType)

--- 怪物配置文件
---@class MobTypeConfig
local MobTypeConfig = {}
local loaded = false

local function LoadConfig()
    MobTypeConfig.config = {
        ["站立恐怖鹿"] = MobType.New(
                {
                    ["怪物ID"] = "站立恐怖鹿",
                    ["显示名"] = "站立恐怖鹿",
                    ["描述"] = "看起来十分恐怖，实际上也十分恐怖。",
                    ["模型"] = "怪物模型/站立恐怖鹿",
                    ["状态机"] = "站立恐怖鹿",
                    ["是首领"] = false,
                    ["无敌"] = false,
                    ["属性公式"] = {
                        ["生命"] = "500",
                        ["攻击"] = "50",
                        ["速度"] = "400"
                    },
                    ["图鉴击杀数"] = 0,
                    ["图鉴完成奖励"] = nil,
                    ["图鉴完成奖励数量"] = 0,
                    ["显示血条"] = true,

                    ["攻击时点"] = 0.5,
                    ["行为"] = {
                        {
                            ["额外攻击距离"] = 100,
                            ["类型"] = "近战攻击",
                            ["无限视距"] = true,
                        },
                        {
                            ["距离"] = 500,
                            ["保持在出生点附近"] = false,
                            ["几率"] = 50,
                            ["类型"] = "随机移动"
                        },
                        {
                            ["类型"] = "静止"
                        }
                    },
                    ["闲置音效"] = "",
                    ["攻击音效"] = "",
                    ["受击音效"] = "",
                    ["死亡音效"] = "",
                    ["掉落倍率"] = {
                        ["金币"] = 100
                    },
                    ["技能"] = {
                        {
                            ["时机"] = "周期",
                            ["默认目标"] = "目标",
                            ["魔法"] = {
                                ["魔法"] = "副_豌豆射手_入口"
                            },
                            ["距离"] = 0
                        }
                    },
                }),
        ["野兔"] = MobType.New(
                {
                    ["怪物ID"] = "野兔",
                    ["显示名"] = "野兔",
                    ["描述"] = "看起来十分胆小，实际上也十分胆小。",
                    ["模型"] = "怪物模型/野兔",
                    ["状态机"] = "野兔",
                    ["是首领"] = false,
                    ["无敌"] = false,
                    ["属性公式"] = {
                        ["生命"] = "100",
                        ["攻击"] = "0",
                        ["速度"] = "400"
                    },
                    ["图鉴击杀数"] = 0,
                    ["图鉴完成奖励"] = nil,
                    ["图鉴完成奖励数量"] = 0,
                    ["显示血条"] = true,
                    ["被攻击逃跑"] = true,
                    ["行为"] = {
                        {
                            ["保持在出生点附近"] = true,
                            ["几率"] = 1,
                            ["类型"] = "随机移动"
                        },
                        {
                            ["类型"] = "静止"
                        }
                    },
                    ["闲置音效"] = "",
                    ["攻击音效"] = "",
                    ["受击音效"] = "",
                    ["死亡音效"] = "",
                    ["掉落倍率"] = {
                        ["金币"] = 100
                    },
                }),
        ["狂暴邪恶鹿"] = MobType.New(
                {
                    ["怪物ID"] = "狂暴邪恶鹿",
                    ["显示名"] = "狂暴邪恶鹿",
                    ["描述"] = "看起来十分邪恶，实际上也十分邪恶。",
                    ["模型"] = "怪物模型/狂暴邪恶鹿",
                    ["状态机"] = "狂暴邪恶鹿",
                    ["是首领"] = true,
                    ["无敌"] = false,
                    ["属性公式"] = {
                        ["生命"] = "500",
                        ["攻击"] = "50",
                        ["速度"] = "400"
                    },
                    ["图鉴击杀数"] = 0,
                    ["图鉴完成奖励"] = nil,
                    ["图鉴完成奖励数量"] = 0,
                    ["显示血条"] = true,

                    ["攻击时点"] = 0.5,
                    ["行为"] = {
                        {
                            ["类型"] = "近战攻击",
                            ["无限视距"] = true,
                        },
                        {
                            ["额外攻击距离"] = 100,
                            ["距离"] = 500,
                            ["保持在出生点附近"] = false,
                            ["几率"] = 50,
                            ["类型"] = "随机移动"
                        },
                        {
                            ["类型"] = "静止"
                        }
                    },
                    ["闲置音效"] = "",
                    ["攻击音效"] = "",
                    ["受击音效"] = "",
                    ["死亡音效"] = "",
                    ["掉落倍率"] = {
                        ["金币"] = 100
                    },
                    ["技能"] = {
                        {
                            ["时机"] = "周期",
                            ["默认目标"] = "目标",
                            ["魔法"] = {
                                ["魔法"] = "副_豌豆射手_入口"
                            },
                            ["距离"] = 0
                        }
                    },
                }),
        ["凶恶猫头鹰"] = MobType.New(
                {
                    ["怪物ID"] = "凶恶猫头鹰",
                    ["显示名"] = "凶恶猫头鹰",
                    ["描述"] = "看起来十分凶恶，实际上也十分凶恶。",
                    ["模型"] = "怪物模型/凶恶猫头鹰",
                    ["状态机"] = "狂暴邪恶鹿",
                    ["是首领"] = false,
                    ["无敌"] = false,
                    ["属性公式"] = {
                        ["生命"] = "500",
                        ["攻击"] = "50",
                        ["速度"] = "400"
                    },
                    ["图鉴击杀数"] = 0,
                    ["图鉴完成奖励"] = nil,
                    ["图鉴完成奖励数量"] = 0,
                    ["显示血条"] = true,

                    ["攻击时点"] = 0.5,
                    ["行为"] = {
                        {
                            ["额外攻击距离"] = 100,
                            ["类型"] = "近战攻击",
                            ["无限视距"] = true,
                        },
                        {
                            ["距离"] = 500,
                            ["保持在出生点附近"] = false,
                            ["几率"] = 50,
                            ["类型"] = "随机移动"
                        },
                        {
                            ["类型"] = "静止"
                        }
                    },
                    ["闲置音效"] = "",
                    ["攻击音效"] = "",
                    ["受击音效"] = "",
                    ["死亡音效"] = "",
                    ["掉落倍率"] = {
                        ["金币"] = 100
                    },
                    ["技能"] = {
                        {
                            ["时机"] = "周期",
                            ["默认目标"] = "目标",
                            ["魔法"] = {
                                ["魔法"] = "副_豌豆射手_入口"
                            },
                            ["距离"] = 0
                        }
                    },
                }),
        ["野猪"] = MobType.New(
                {
                    ["怪物ID"] = "野猪",
                    ["显示名"] = "野猪",
                    ["描述"] = "看起来十分野猪，实际上也十分野猪。",
                    ["模型"] = "怪物模型/野猪",
                    ["状态机"] = "野猪",
                    ["是首领"] = false,
                    ["无敌"] = false,
                    ["属性公式"] = {
                        ["生命"] = "100",
                        ["攻击"] = "0",
                        ["速度"] = "400"
                    },
                    ["图鉴击杀数"] = 0,
                    ["图鉴完成奖励"] = nil,
                    ["图鉴完成奖励数量"] = 0,
                    ["显示血条"] = true,
                    ["被攻击逃跑"] = false,

                    ["行为"] = {
                        {
                            ["额外攻击距离"] = 150,
                            ["类型"] = "近战攻击",
                            ["主动索敌"] = 500,
                            ["脱战距离"] = 500,
                        },
                        {
                            ["保持在出生点附近"] = true,
                            ["几率"] = 1,
                            ["类型"] = "随机移动"
                        },
                        {
                            ["类型"] = "静止"
                        }
                    },
                    ["闲置音效"] = "",
                    ["攻击音效"] = "",
                    ["受击音效"] = "",
                    ["死亡音效"] = "",
                    ["掉落倍率"] = {
                        ["金币"] = 100
                    },
                }),
        ["黑熊"] = MobType.New(
                {
                    ["怪物ID"] = "黑熊",
                    ["显示名"] = "黑熊",
                    ["描述"] = "看起来十分黑熊，实际上也十分黑熊。",
                    ["模型"] = "怪物模型/黑熊",
                    ["状态机"] = "黑熊",
                    ["是首领"] = false,
                    ["无敌"] = false,

                    ["属性公式"] = {
                        ["生命"] = "100",
                        ["攻击"] = "0",
                        ["速度"] = "400"
                    },
                    ["图鉴击杀数"] = 0,
                    ["图鉴完成奖励"] = nil,
                    ["图鉴完成奖励数量"] = 0,
                    ["显示血条"] = true,
                    ["被攻击逃跑"] = false,
                    ["行为"] = {
                        {
                            ["额外攻击距离"] = 150,
                            ["类型"] = "近战攻击",
                            ["主动索敌"] = 500,
                            ["脱战距离"] = 500,
                        },
                        {
                            ["保持在出生点附近"] = true,
                            ["几率"] = 1,
                            ["类型"] = "随机移动"
                        },
                        {
                            ["类型"] = "静止"
                        }
                    },
                    ["闲置音效"] = "",
                    ["攻击音效"] = "",
                    ["受击音效"] = "",
                    ["死亡音效"] = "",
                    ["掉落倍率"] = {
                        ["金币"] = 100
                    },
                }),

    }
    loaded = true
end

---@param mobType string
---@return MobType
function MobTypeConfig.Get(mobType)
    if not loaded then
        LoadConfig()
    end
    return MobTypeConfig.config[mobType]
end

---@return MobType[]
function MobTypeConfig.GetAll()
    if not loaded then
        LoadConfig()
    end
    return MobTypeConfig.config
end
return MobTypeConfig
